Terraform plan in __terraform__
<details>
  <summary>Plan: 3 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_cloudfunctions_function.gmail_notifier_oauth2init_function will be created
  + resource "google_cloudfunctions_function" "gmail_notifier_oauth2init_function" {
      + available_memory_mb   = 128
      + description           = "gmail-notifier entry point"
      + entry_point           = "oauth2init"
      + https_trigger_url     = (known after apply)
      + id                    = (known after apply)
      + max_instances         = 0
      + name                  = "oauth2init"
      + project               = (known after apply)
      + region                = (known after apply)
      + runtime               = "nodejs14"
      + service_account_email = (known after apply)
      + source_archive_bucket = "lilaobot-functions-storage"
      + source_archive_object = "gmail_notifier.zip#2317e97762d691e9600e56b580495dd8"
      + timeout               = 60
      + trigger_http          = true

      + event_trigger {
          + event_type = (known after apply)
          + resource   = (known after apply)

          + failure_policy {
              + retry = (known after apply)
            }
        }
    }

  # google_cloudfunctions_function.slack_publisher_function will be created
  + resource "google_cloudfunctions_function" "slack_publisher_function" {
      + available_memory_mb   = 128
      + description           = "Receives messages from Pub/sub and send them to Slack"
      + entry_point           = "publishToSlack"
      + https_trigger_url     = (known after apply)
      + id                    = (known after apply)
      + max_instances         = 0
      + name                  = "slack-publisher"
      + project               = (known after apply)
      + region                = (known after apply)
      + runtime               = "python39"
      + service_account_email = (known after apply)
      + source_archive_bucket = "lilaobot-functions-storage"
      + source_archive_object = "slack_publisher.zip#4fbd529289d366c584be6729c6d80e09"
      + timeout               = 60

      + event_trigger {
          + event_type = "providers/cloud.pubsub/eventTypes/topic.publish"
          + resource   = "projects/lilaobot/topics/calls_for_offer"

          + failure_policy {
              + retry = (known after apply)
            }
        }
    }

  # google_cloudfunctions_function_iam_member.invoker will be created
  + resource "google_cloudfunctions_function_iam_member" "invoker" {
      + cloud_function = "slack-publisher"
      + etag           = (known after apply)
      + id             = (known after apply)
      + member         = "allUsers"
      + project        = (known after apply)
      + region         = (known after apply)
      + role           = "roles/cloudfunctions.invoker"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>

Plan generated in [Create terraform plan #24](https://github.com/Zenika/lilaobot/actions/runs/1093491806)